toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
            // Release power assertion
            _Power.release();
            
            // Release control of the LED
            _LEDRed_::Set(_LEDPriority::Capture, std::nullopt);
        }
    }
    
//    static void _Init() {
//        // Reset our shared state
//        // This is used to init our task after it's been stopped in an arbitrary state.
//        _Motion = false;
//    }
//    
//    static bool DeepSleepOK() {
//        // Permit LPM3.5 if we're waiting for motion, and neither of our tasks are doing anything.
//        // This logic works because if _WaitingForMotion==true, then we've disabled both _TaskSD
//        // and _TaskImg, so if the tasks are idle, then everything's idle so we can enter deep
//        // sleep. (The case that we need to be careful of is going to sleep when either _TaskSD
//        // or _TaskImg is idle but still powered on, which the _WaitingForMotion check takes
//        // care of.)
//        return _WaitingForMotion                &&
//               !_Scheduler::Running<_TaskSD>()  &&
//               !_Scheduler::Running<_TaskImg>() ;
//    }
    
    static void ISR_MotionSignal(uint16_t iv) {
        _TrigSrc |= _TriggerSources::Motion;
    }
    
//    // _Init: stores whether this is the first
//    [[gnu::section(".ram_backup.main")]]
//    static inline bool _FirstRunDone = false;
//    
//    // _MotionTrigger: announces that motion occurred
//    static volatile inline bool _MotionTrigger = false;
//    
//    // _ManualTrigger: manual capture trigger
//    static volatile inline bool _ManualTrigger = false;
    
    static volatile inline _TriggerSource _TrigSrc = _TriggerSources::None;
    
    static inline _PowerAssertion _Power;
    
    // Task stack
    [[gnu::section(".stack._TaskMain")]]
    alignas(sizeof(void*))
    static inline uint8_t Stack[256];
};

static void _CapturePause() {
    _TaskMain::Reset();
}

static void _CaptureResume() {
    _TaskMain::Start();
}

struct _TaskI2C {
    static void Run() {
        for (;;) {
            // Wait until the I2C lines are activated (ie VDD_B_3V3_STM becomes powered)
            _I2C::WaitUntilActive();
            
            // Maintain power while I2C is active
            _PowerAssertion power;
            power.acquire();
            
            for (;;) {
                // Wait for a command
                MSP::Cmd cmd;
                
                bool ok = _I2C::Recv(cmd);
                if (!ok) break;
                
                // Handle command
                const MSP::Resp resp = _CmdHandle(cmd);
                
                ok = _I2C::Send(resp);
                if (!ok) break;
            }
            
            // Cleanup
            
//            // Relinquish LEDs
            _LEDRed_::Set(_LEDPriority::I2C, std::nullopt);
            _LEDGreen_::Set(_LEDPriority::I2C, std::nullopt);
            
            // Release capture-pause assertion if it was held
            _HostMode = {};
        }
    }
    
    static MSP::Resp _CmdHandle(const MSP::Cmd& cmd) {
        using namespace MSP;
        switch (cmd.op) {
        case Cmd::Op::StateRead: {
            const size_t off = cmd.arg.StateRead.chunk * sizeof(MSP::Resp::arg.StateRead.data);
            if (off > sizeof(_State)) return MSP::Resp{ .ok = false };
            const size_t rem = sizeof(_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Resp::arg.StateRead.data));
            MSP::Resp resp = { .ok = true };
            memcpy(resp.arg.StateRead.data, (uint8_t*)&_State+off, len);
            return resp;
        }
        
        case Cmd::Op::StateWrite: {
            const size_t off = cmd.arg.StateWrite.chunk * sizeof(MSP::Cmd::arg.StateWrite.data);
            if (off > sizeof(_State)) return MSP::Resp{ .ok = false };
            const size_t rem = sizeof(_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Cmd::arg.StateWrite.data));
            memcpy((uint8_t*)&_State+off, cmd.arg.StateWrite.data, len);
            return MSP::Resp{ .ok = true };
        }
        
        case Cmd::Op::LEDSet:
            _LEDRed_::Set(_LEDPriority::I2C, !cmd.arg.LEDSet.red);
            _LEDGreen_::Set(_LEDPriority::I2C, !cmd.arg.LEDSet.green);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::TimeGet:
            return MSP::Resp{
                .ok = true,
                .arg = { .TimeGet = { .time = _RTC::TimeRead() } },
            };
        
        case Cmd::Op::TimeSet:
            _RTC::Init(cmd.arg.TimeSet.time);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::HostModeSet:
            if (cmd.arg.HostModeSet.en != _HostMode.acquired()) {
                if (cmd.arg.HostModeSet.en) {
                    _HostMode.acquire();
                } else {
                    _HostMode.release();
                }
            }
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::VDDIMGSDSet:
            _VDDIMGSDSet(cmd.arg.VDDIMGSDSet.en);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::BatteryChargeLevelGet: {
            return MSP::Resp{
                .ok = true,
                .arg = { .BatteryChargeLevelGet = { .level = _BatterySampler::Sample() } },
            };
        }
        
        default:
            return MSP::Resp{ .ok = false };
        }
    }
    
    static bool HostModeEnabled() {
        return _HostMode.acquired();
    }
    
    static inline _CapturePauseAssertion _HostMode;
    
    // Task stack
    [[gnu::section(".stack._TaskI2C")]]
    alignas(sizeof(void*))
    static inline uint8_t Stack[256];
};

struct _TaskButton {
    static void Run() {
        // Pause captures upon power on. This is so that the device is off until
        // the user turns it on by holding the power button.
        _OffAssertion.acquire();
        
        for (;;) {
            const _Button::Event ev = _Button::WaitForEvent();
            // Ignore all interaction in host mode
            if (_TaskI2C::HostModeEnabled()) continue;
            
            // Keep the lights on until we're done handling the event
            _PowerAssertion power;
            power.acquire();
            
